Revit 2015 API
Parameter Methods
The Parameter type exposes the following members.
Methods
Name | Description
AsDouble
Provides access to the double precision number within the parameter.
AsElementId
Provides access to the Autodesk::Revit::DB::ElementId^ stored within the parameter.
AsInteger
Provides access to the integer number within the parameter.
AsString
Provides access to the string contents of the parameter.
AsValueString()
Get the parameter value as a string with units.
AsValueString(FormatOptions)
Get the parameter value as a string with units.
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Set(Double)
Sets the parameter to a new real number value.
Set(Int32)
Sets the parameter to a new integer value.
Set(String)
Sets the parameter to a new string of text.
Set(ElementId)
Sets the parameter to a new element id.
SetValueString
Set the parameter value according to the input string.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
Parameter Class
Autodesk.Revit.DB Namespace